backend/app/controllers/movies_controller.rb

  def index
    movies = Movie.all
---
SELECT "movies".* FROM "movies"

  def create
    movie = Movie.find_by(title: movie_params[:title])
    thumbs_type = movie_params[:thumbs_type]== "thumbs_up" ? "up" : "down"
    # byebug
    if movie == nil
        if thumbs_type == "up"
          movie =  Movie.create(title: movie_params[:title], imdb_id: movie_params[:imdbID], thumbs_up: 1)
        elsif thumbs_type == "down"
          movie = Movie.create(title: movie_params[:title],imdb_id: movie_params[:imdbID], thumbs_down: 1)
        end
    elsif movie != nil
      if thumbs_type == "up"
        movie.update(thumbs_up: movie.thumbs_up += 1)
      elsif thumbs_type == "down"
        movie.update(thumbs_down: movie.thumbs_down += 1)
---
SELECT "movies".* FROM "movies" WHERE "movies"."title" = $1 LIMIT $2  [["title", "The Matrix Reloaded"], ["LIMIT", 1]]
INSERT INTO "movies" ("title", "imdb_id", "thumbs_up", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "The Matrix Reloaded"], ["imdb_id", "tt0234215"], ["thumbs_up", 1], ["created_at", "2020-12-05 01:14:43.971036"], ["updated_at", "2020-12-05 01:14:43.971036"]]
INSERT INTO "movies" ("title", "imdb_id", "thumbs_down", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "'Donnie Darko': Production Diary"], ["imdb_id", "tt0437161"], ["thumbs_down", 1], ["created_at", "2020-12-05 01:52:51.667212"], ["updated_at", "2020-12-05 01:52:51.667212"]]
UPDATE "movies" SET "thumbs_up" = $1, "updated_at" = $2 WHERE "movies"."id" = $3  [["thumbs_up", 2], ["updated_at", "2020-12-05 01:14:49.843167"], ["id", 2]]
UPDATE "movies" SET "thumbs_down" = $1, "updated_at" = $2 WHERE "movies"."id" = $3  [["thumbs_down", 1], ["updated_at", "2020-12-05 03:00:37.196310"], ["id", 5]]